system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin -0.0151;
xmax 0.0151;
ymin -0.0151;
ymax 0.015;
zmin -0.003;
zmax 0.013;

vertices
(
    (  $xmin  $ymin  $zmin  )
    (  $xmax  $ymin  $zmin  )
    (  $xmax  $ymax  $zmin  )
    (  $xmin  $ymax  $zmin  )
    (  $xmin  $ymin  $zmax )
    (  $xmax  $ymin  $zmax )
    (  $xmax  $ymax  $zmax )
    (  $xmin  $ymax  $zmax )
);

blocks
(
    // hex (0 1 2 3 4 5 6 7) (30 30 30) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (30 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

	inlet
	{
		type patch;
		faces
		(
			(0 3 2 1)//inlet
		);
	}
	
	
	wall
	{
		type patch;
		faces
		(
			(0 4 7 3) //wall
			(1 5 4 0) //wall
			(3 7 6 2)
			(2 6 5 1)
		);
	}
	
	outlet
	{
		type patch;
		faces
		(
			
			(4 5 6 7)//outlet
		);
	}
	
	
);

// ************************************************************************* //
