system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance 1E-3;

pointSync false;

patches
(
    {
        name wall;

        patchInfo
        {
            type        patch;
        }

        constructFrom patches;

        patches (auto0);
    }
    {
        name inlet;

        patchInfo
        {
            type        patch;
        }

        constructFrom patches;

        patches (auto2);
    }

    {
        name outlet;

        patchInfo
        {
            type        patch;
        }

        constructFrom patches;

        patches (auto1);
    }
    

);

// ************************************************************************* //
